DataProcessors/umk_ПечатьТТН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_ПечатьТТН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаИГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомерПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удостоверение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПолучен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаМассы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Межгород</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаОбщаяТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/umk_ДанныеПутевыеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_ДанныеПутевыеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаркаИГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНомерПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удостоверение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПолучен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаМассы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Межгород</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/umk_ГрафикиРаботыСкладскихРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_ГрафикиРаботыСкладскихРаботников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/umk_ПечатьТТН/Forms/ФормаУФ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	Объект.Документ = Документ;
	Объект.Дата = Документ.Дата;
	Объект.ПунктРазгрузки = ?(ЗначениеЗаполнено(Документ.umk_Регион), Документ.umk_Регион, Документ.АдресДоставки);
	КодЯзыкаПечать = "uk";	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Документ.Организация, Документ.Дата,,,КодЯзыкаПечать);
	
	Объект.Перевозчик     = Документ.Организация.НаименованиеПолное;
	Объект.ПунктПогрузки  = СведенияОПоставщике.ЮридическийАдрес;

	Организация = Документ.Организация;
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	КратностьПечати = 1;
	
	// Если ФОПы то введем кратность документа
	Если Документ.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		//Если Не ВвестиЧисло(КратностьПечати,"Введите кратность количества документа" ,15,2)
		//	Тогда
			КратностьПечати = 1;
		//КонецЕсли;
		
		Если КратностьПечати = 0
			Тогда
			КратностьПечати = 1;
		КонецЕсли;
		
	КонецЕсли;

	ВыборкаПоРегистру = ПолучитьВыборкуПоРегистру();
	
	Если  ВыборкаПоРегистру.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ВыборкаПоРегистру);
		АвтомобильСсылка = ВыборкаПоРегистру.АвтомобильСсылка;
	Иначе
		Автомобиль = Справочники.ОсновныеСредства.ПустаяСсылка();	
		УстановитьНомер();
		УстановитьТипЦен();
		УстановитьВидимостьДоступность();
	КонецЕсли;
	
	Если Не Объект.Город И НЕ Объект.Межгород Тогда
		УстановитьВидПеревозки();
	КонецЕсли;
	
	УстановитьМассу();
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ПоказатьПредупреждение(,"Не выбран документ!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		ПоказатьПредупреждение(,"Не выбран вид перевозки!");
		Возврат;
	КонецЕсли;

	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ТабДокумент = ПечатьТТН();
	Иначе
		Сообщить("ПечатнаяФорма не определена");
		Возврат;
	КонецЕсли;
	
	ЗпаписатьДанныеФормыВРС();
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТН_УФ";
	ТабДокумент.Показать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция ПечатьТТН() Экспорт
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза",          Документ.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Документ.Склад);
	Запрос.УстановитьПараметр("ТекущийДокумент",  Документ);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация КАК ЮрФизЛицо,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.Организация КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация КАК Руководители,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	РеализацияТоваровУслуг.Контрагент КАК Плательщик,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ОтветственноеЛицо1,
	|	РеализацияТоваровУслуг.Подразделение,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК Курс,
	|	РеализацияТоваровУслуг.КратностьВзаиморасчетов КАК Кратность,
	|	РеализацияТоваровУслуг.УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.ОтпускПроизвел,
	|	РеализацияТоваровУслуг.Получил КАК ДоверенностьЧерезКого,
	|	РеализацияТоваровУслуг.ДоверенностьСерия,
	|	РеализацияТоваровУслуг.ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата,
	|	Константы.umk_ОтпускРазрешил.Ссылка КАК ОтпускРазрешил,
	|	РеализацияТоваровУслуг.ПредставительОрганизации.Наименование КАК ОтветственноеЛицо
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ОтветственныеЛица
	|		ПО (ОтветственныеЛица.СтруктурнаяЕдиница = РеализацияТоваровУслуг.Склад),
	|	Константы КАК Константы
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Документ);
	Запрос.УстановитьПараметр("КратностьПечати", КратностьПечати);

	Если Документ.ВалютаДокумента = Документ.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		// Документ оформлен в валюте взаиморасчетов
		Запрос.УстановитьПараметр("Курс", Документ.КурсВзаиморасчетов);
		Запрос.УстановитьПараметр("Кратность", Документ.КратностьВзаиморасчетов);
	Иначе
		// Документ оформлен в валюте регламентированного учета
		Запрос.УстановитьПараметр("Курс", 1);
		Запрос.УстановитьПараметр("Кратность", 1);
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура                                 КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное              КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура." + ТоварКод + "                КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление               КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения                             КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление           КАК ВидУпаковки,
	|	ВложенныйЗапрос.Характеристика      КАК Характеристика,
	|	ВложенныйЗапрос.Серия               КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС           КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена                КАК Цена,
	|	ВЫБОР
	|		КОГДА((ВложенныйЗапрос.ПроцентСкидкиНаценки = 0) И 
	|		      (ВложенныйЗапрос.ПроцентАвтоматическихСкидок = 0))
	|	ТОГДА ЛОЖЬ
	|	ИНАЧЕ Истина
	|	КОНЕЦ                                КАК ЕстьСкидкиПоСтроке,
	|	ВложенныйЗапрос.Количество          КАК Количество,
	|	ВложенныйЗапрос.КоличествоМест      КАК КоличествоМест,
	|	ВложенныйЗапрос.Сумма               КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС            КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки         КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка               КАК Метка
	|ИЗ
	|
	|	(
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры            КАК Характеристика,
	|		РеализацияТоваровУслуг.СерияНоменклатуры                     КАК Серия,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена * &Курс / &Кратность             КАК Цена,
	|		РеализацияТоваровУслуг.ПроцентСкидкиНаценки,
	|		РеализацияТоваровУслуг.ПроцентАвтоматическихСкидок,
	|		СУММА(РеализацияТоваровУслуг.Количество * &КратностьПечати)                     КАК Количество,
	|		СУММА(РеализацияТоваровУслуг.КоличествоМест * &КратностьПечати)                 КАК КоличествоМест,
	|		СУММА(РеализацияТоваровУслуг.Сумма    * &Курс * &КратностьПечати / &Кратность)  КАК Сумма,
	|		СУММА(РеализацияТоваровУслуг.СуммаНДС * &Курс * &КратностьПечати / &Кратность)  КАК СуммаНДС,
	|		МИНИМУМ(РеализацияТоваровУслуг.НомерСтроки)                  КАК НомерСтроки,
	|		0                                                            КАК Метка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслуг.Номенклатура,
	|		РеализацияТоваровУслуг.Коэффициент,
	|		РеализацияТоваровУслуг.ЕдиницаИзмерения,
	|		РеализацияТоваровУслуг.ЕдиницаИзмеренияМест,
	|		РеализацияТоваровУслуг.ХарактеристикаНоменклатуры,
	|		РеализацияТоваровУслуг.СерияНоменклатуры,
	|		РеализацияТоваровУслуг.СтавкаНДС,
	|		РеализацияТоваровУслуг.Цена,
	|		РеализацияТоваровУслуг.ПроцентСкидкиНаценки,
	|		РеализацияТоваровУслуг.ПроцентАвтоматическихСкидок
	|
	|	) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номенклатура                    КАК Номенклатура,
	|	РеализацияТоваровУслуг.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	РеализацияТоваровУслуг.Номенклатура." + ТоварКод + "   КАК Артикул,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.Представление               КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаХраненияОстатков                             КАК ЕдиницаИзмерения,
	|	NULL                                                  КАК ВидУпаковки,
	|	NULL                                                  КАК Характеристика,
	|	NULL                                                  КАК Серия,
	|	""Без НДС""                                           КАК СтавкаНДС,
	|	РеализацияТоваровУслуг.Цена * &Курс / &Кратность      КАК Цена,
	|	Ложь                                                  КАК ЕстьСкидкиПоСтроке,
	|	РеализацияТоваровУслуг.Количество                     КАК Количество,
	|	0                                                     КАК КоличествоМест,
	|	РеализацияТоваровУслуг.Сумма * &Курс / &Кратность     КАК Сумма,
	|	0                                                     КАК СуммаНДС,
	|	РеализацияТоваровУслуг.НомерСтроки                    КАК НомерСтроки,
	|	2                                                     КАК Метка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО Метка ВОЗР, НомерСтроки ВОЗР
	|
	|";

	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	ТабДокумент = Новый ТабличныйДокумент;

	Если Шапка.ДатаДокумента < Дата("20140114") Тогда
		Возврат Новый ТабличныйДокумент //нет процедуры
	Иначе 
	    ЗаполнитьТТН2014(Шапка, ЗапросТовары, ТабДокумент);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьТТН()

&НаСервере
Процедура ЗаполнитьТТН2019(Шапка, ЗапросТовары, ТабДокумент, ОпределятьЦенуПоТипуЦен = Ложь) 

	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 5;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 5;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;

	Макет       = Обработки.umk_ПечатьТТН.ПолучитьМакет("ТТН2019");
	
	КодЯзыкаПечать = "uk";

	// Выводим общие реквизиты шапки
	СведенияОПоставщике       = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ЮрФизЛицо,        Шапка.ДатаДокумента,, Шапка.БанковскийСчет);
	СведенияОПокупателе       = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель,       Шапка.ДатаДокумента);
	СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузополучатель,  Шапка.ДатаДокумента);
	СведенияОГрузоотправитель = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДокумента                = Объект.НомерТТН;
	ОбластьМакета.Параметры.ДатаДокумента                 = Формат(Шапка.ДатаДокумента,"Л=uk_UA; ДФ='dd MMMM yyyy'") +" року";
	ОбластьМакета.Параметры.Грузоотправитель              = Шапка.Грузоотправитель;
	ОбластьМакета.Параметры.Грузополучатель               = Шапка.Грузополучатель;
	ОбластьМакета.Параметры.Плательщик                    = Шапка.Покупатель;
	ОбластьМакета.Параметры.ГрузоотправительПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,МФО,КодПоЕДРПОУ",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.ГрузополучательПредставление  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,МФО,КодПоЕДРПОУ",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.ПлательщикПредставление       = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,МФО,КодПоЕДРПОУ",,КодЯзыкаПечать);
	
	ОбластьМакета.Параметры.МаркаИГосНомерАвтомобиля = Объект.МаркаИГосНомерАвтомобиля;
	ОбластьМакета.Параметры.ФИОВодителя = Объект.Водитель;
	ОбластьМакета.Параметры.ВидПеревозки = Объект.ВидПеревозки;
	ОбластьМакета.Параметры.ГосНомерПрицепа = Объект.ГосНомерПрицепа; 
	
	ОбластьМакета.Параметры.ПунктПогрузки = Объект.ПунктПогрузки;
	ОбластьМакета.Параметры.ПунктРазгрузки = Объект.ПунктРазгрузки;
	
	ОбластьМакета.Параметры.ОрганизацияПеревозчик = Объект.Перевозчик;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Руководители, Шапка.ДатаДокумента,);
	Руководитель = Руководители.Руководитель;
	
	// Отпуск товара разрешил
	Если НЕ ЗначениеЗаполнено(Шапка.ОтпускРазрешил) Тогда
		ФИООтпускРазрешил       = Руководитель;
		ДолжностьОтпускРазрешил = Руководители.РуководительДолжность;
	Иначе
		ФамилияИмяОтчествоФизЛица        = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Шапка.ОтпускРазрешил, Шапка.ДатаДокумента);
		ПодразделениеДолжностьФизЛица    = ФормированиеПечатныхФорм.ДолжностьОтветственногоЛицаОрганизации(Шапка.ОтпускРазрешил, Шапка.ДатаДокумента, Шапка.Организация);
		ФамилияИмяОтчествоОтпускРазрешил = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
		ФИООтпускРазрешил                = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоОтпускРазрешил);
		ДолжностьОтпускРазрешил          = ПодразделениеДолжностьФизЛица.Должность;
	КонецЕсли;
	
	
	Если ОпределятьЦенуПоТипуЦен Тогда
		ЗапросТовары.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ИтогоСуммаСНДС = 0;
		Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл
			Если ВыборкаСтрок.Метка = 2
			 ИЛИ НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
				СуммаСНДС = 0;
			Иначе
				Если ВыборкаСтрок.Цена = 0 Тогда
					Цена = Ценообразование.ПолучитьЦенуНоменклатуры(ВыборкаСтрок.Номенклатура, ВыборкаСтрок.Характеристика,
					                                Объект.ТипЦен, Шапка.ДатаДокумента, ВыборкаСтрок.ЕдиницаИзмерения,
					                                мВалютаРегламентированногоУчета, 1, 1);
				Иначе
					Цена = ВыборкаСтрок.Цена;
				КонецЕсли;

				СуммаСНДС = Окр(ВыборкаСтрок.Количество * Цена, 2);
			КонецЕсли;
			ВыборкаСтрок.СуммаСНДС = СуммаСНДС;
			ИтогоСуммаСНДС = ИтогоСуммаСНДС + СуммаСНДС;
		КонецЦикла;
	Иначе
		ИтогоСуммаСНДС = Окр((ЗапросТовары.Итог("Сумма") + ?(Шапка.СуммаВключаетНДС, 0, ЗапросТовары.Итог("СуммаНДС"))), 2);
	КонецЕсли;
	
	ОбластьМакета.Параметры.ОтпущеноНаСуммуПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСуммаСНДС, глЗначениеПеременной("ВалютаРегламентированногоУчета"), КодЯзыкаПечать);
	Если ЗапросТовары.Итог("СуммаНДС") > 0 Тогда
		ОбластьМакета.Параметры.СуммаНДС                = ОбщегоНазначения.ФорматСумм(ЗапросТовары.Итог("СуммаНДС"), глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	КонецЕсли;
	
	Количество = ЗапросТовары.Итог("Количество");
	КоличествоМест = ?(Цел(Количество) = Количество, Количество, Цел(Количество) + 1);
	КоличествоМестПрописью = НРег(ЧислоПрописью(КоличествоМест,"Л=uk_UK"));
	ОбластьМакета.Параметры.КоличествоМестПрописью  = Лев(КоличествоМестПрописью,СтрДлина(КоличествоМестПрописью)-3);
	
	// + umk
	ОбластьМакета.Параметры.ИтогоМасса  = НРег(ЧислоПрописью(Окр(Количество/1000,2, РежимОкругления.Окр15как20),"Л=uk_UK"));
    // - umk
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();


	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	КоличествоСтрок = ЗапросТовары.Количество();


	// инициализация итогов по странице
	ИтогоКоличествоНаСтранице = 0;
	ИтогоСуммаСНДСНаСтранице  = 0;

	// инициализация итогов по документу
	ИтогоМест       = 0;
	ИтогоКоличество = 0;
	ИтогоСуммаСНДС  = 0;
	НомерСтроки     = 0;

	// Выводим многострочную часть докмента
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрок.Номенклатура) Тогда
			Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрок);
		ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрок.ТоварНаименование;
		
		НомерСтроки = НомерСтроки + 1;
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;

		Мест        = ВыборкаСтрок.КоличествоМест;
		Количество  = ВыборкаСтрок.Количество;
		Если ОпределятьЦенуПоТипуЦен Тогда
			СуммаСНДС = ВыборкаСтрок.СуммаСНДС;
			СуммаБезНДС = СуммаСНДС;
		Иначе
			СуммаСНДС   = Окр((ВыборкаСтрок.Сумма + ?(Шапка.СуммаВключаетНДС, 0, ВыборкаСтрок.СуммаНДС)), 2);
			СуммаБезНДС = СуммаСНДС-ВыборкаСтрок.СуммаНДС;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Сумма = СуммаСНДС;
		ОбластьМакета.Параметры.Цена = ?(Количество = 0, 0, СуммаБезНДС / Количество);

		ТабДокумент.Вывести(ОбластьМакета);


		// увеличим итоги по дукументу
		ИтогоМест       = ИтогоМест       + Мест;
		ИтогоКоличество = ИтогоКоличество + Количество;
		ИтогоСуммаСНДС  = ИтогоСуммаСНДС  + СуммаСНДС;

	КонецЦикла;

	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогоКоличество = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогоСуммаСНДС  = ИтогоСуммаСНДС;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	ТабДокумент.Вывести(ОбластьМакета);

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТТН2014(Шапка, ЗапросТовары, ТабДокумент, ОпределятьЦенуПоТипуЦен = Ложь) 

	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 5;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 5;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	ЭтоФОП =  Шапка.ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;

	Макет       = Обработки.umk_ПечатьТТН.ПолучитьМакет("ТТН2014");
	
	КодЯзыкаПечать = "uk";
	ДокументыСопровождения = "№" + Документ.Номер + " від " + Формат(Документ.Дата,"ДФ=dd.MM.yyyy") + ?(ЭтоФОП = Истина, "", ПолучитьУК());

	// Выводим общие реквизиты шапки
	СведенияОПоставщике       = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ЮрФизЛицо,        Шапка.ДатаДокумента,, Шапка.БанковскийСчет);
	СведенияОПокупателе       = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель,       Шапка.ДатаДокумента);
	СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузополучатель,  Шапка.ДатаДокумента);
	СведенияОГрузоотправитель = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента);
    СведенияОПеревозчик       = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Документ.Организация,   Шапка.ДатаДокумента); 

	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	
	//ИНН
	ОбластьМакета.Параметры.ИНН_Перевозчик       = СведенияОПеревозчик.ИНН; 
	ОбластьМакета.Параметры.ИНН_Грузоотправитель = СведенияОГрузоотправитель.ИНН;
	ОбластьМакета.Параметры.ИНН_Грузополучатель  = СведенияОГрузополучателе.ИНН;
	
	ОбластьМакета.Параметры.НомерДокумента                = Объект.НомерТТН;
	ОбластьМакета.Параметры.ДатаДокумента                 = Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.Грузоотправитель              = Шапка.Грузоотправитель;
	ОбластьМакета.Параметры.Грузополучатель               = Шапка.Грузополучатель;
	//ОбластьМакета.Параметры.Плательщик                    = Шапка.Покупатель;
	//ОбластьМакета.Параметры.ГрузоотправительПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,МФО,КодПоЕДРПОУ",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.ГрузополучательПредставление  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  "ПолноеНаименование,ЮридическийАдрес",,КодЯзыкаПечать);
	
	ОбластьМакета.Параметры.ГрузоотправительПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование",,КодЯзыкаПечать);
	//ОбластьМакета.Параметры.ГрузополучательПредставление  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  "ПолноеНаименование",,КодЯзыкаПечать);
	
	
	
	//ОбластьМакета.Параметры.ПлательщикПредставление       = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,МФО,КодПоЕДРПОУ",,КодЯзыкаПечать);
	ОбластьМакета.Параметры.ДокументыСопровождения        = "Накладна " + ДокументыСопровождения;
	
	ОбластьМакета.Параметры.МаркаИГосНомерАвтомобиля = Объект.МаркаИГосНомерАвтомобиля;
	ОбластьМакета.Параметры.ФИОВодителя = Объект.Водитель;
	ОбластьМакета.Параметры.Удостоверение = Объект.Удостоверение;
	ОбластьМакета.Параметры.ВидПеревозки = Объект.ВидПеревозки;
	ОбластьМакета.Параметры.ГосНомерПрицепа = Объект.ГосНомерПрицепа; 
	
	Если Не ЭтоФОП Тогда
		ОбластьМакета.Параметры.ОтветственноеЛицо = Шапка.ОтветственноеЛицо;
	Иначе
		ОбластьМакета.Параметры.ОтветственноеЛицо = Шапка.ЮрФизЛицо.ИндивидуальныйПредприниматель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПунктПогрузки) Тогда
		ОбластьМакета.Параметры.ПунктПогрузки = СведенияОГрузоотправитель.ЮридическийАдрес;
	Иначе
		ОбластьМакета.Параметры.ПунктПогрузки = Объект.ПунктПогрузки;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПунктРазгрузки) Тогда
		Объект.ПунктРазгрузки = СведенияОГрузополучателе.ЮридическийАдрес;
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПунктРазгрузки = Объект.ПунктРазгрузки;
	
	ОбластьМакета.Параметры.ОрганизацияПеревозчик = Объект.Перевозчик;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Руководители, Шапка.ДатаДокумента,);
	Руководитель = Руководители.Руководитель;
	
	// Отпуск товара разрешил
	Если НЕ ЗначениеЗаполнено(Шапка.ОтпускРазрешил) Тогда
		ФИООтпускРазрешил       = Руководитель;
		ДолжностьОтпускРазрешил = Руководители.РуководительДолжность;
	Иначе
		ФамилияИмяОтчествоФизЛица        = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Шапка.ОтпускРазрешил, Шапка.ДатаДокумента);
		ПодразделениеДолжностьФизЛица    = umk_Доработки.ДолжностьОтветственногоЛицаОрганизации(Шапка.ОтпускРазрешил, Шапка.ДатаДокумента, Шапка.Организация);
		ФамилияИмяОтчествоОтпускРазрешил = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
		ФИООтпускРазрешил                = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоОтпускРазрешил);
		ДолжностьОтпускРазрешил          = ПодразделениеДолжностьФизЛица.Должность;
	КонецЕсли;
	
	Если Не ЭтоФОП Тогда
		
		ОбластьМакета.Параметры.ОтпускРазрешилДолжность = "" + ФИООтпускРазрешил + ", " + ДолжностьОтпускРазрешил;	
		
	Иначе
		ОбластьМакета.Параметры.ОтпускРазрешилДолжность = "" + Шапка.ЮрФизЛицо.НаименованиеПолное;  // Для ФОПа
	КонецЕсли;
	
//	ОбластьМакета.Параметры.ДоверенностьЧерезКого   = Шапка.ДоверенностьЧерезКого;
//	ОбластьМакета.Параметры.СерияДоверенности       = Шапка.ДоверенностьСерия;
//	ОбластьМакета.Параметры.НомерДоверенности       = Шапка.ДоверенностьНомер;
//	ОбластьМакета.Параметры.ДатаДоверенности        = Формат(Шапка.ДоверенностьДата, "ДФ = ""дд.ММ.гггг""");
	
	Если ОпределятьЦенуПоТипуЦен Тогда
		ЗапросТовары.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ИтогоСуммаСНДС = 0;
		Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл
			Если ВыборкаСтрок.Метка = 2
			 ИЛИ НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
				СуммаСНДС = 0;
			Иначе
				Если ВыборкаСтрок.Цена = 0 Тогда
					Цена = Ценообразование.ПолучитьЦенуНоменклатуры(ВыборкаСтрок.Номенклатура, ВыборкаСтрок.Характеристика,
					                                Объект.ТипЦен, Шапка.ДатаДокумента, ВыборкаСтрок.ЕдиницаИзмерения,
					                                мВалютаРегламентированногоУчета, 1, 1);
				Иначе
					Цена = ВыборкаСтрок.Цена;
				КонецЕсли;

				СуммаСНДС = Окр(ВыборкаСтрок.Количество * Цена, 2);
			КонецЕсли;
			ВыборкаСтрок.СуммаСНДС = СуммаСНДС;
			ИтогоСуммаСНДС = ИтогоСуммаСНДС + СуммаСНДС;
		КонецЦикла;
	Иначе
		ИтогоСуммаСНДС = Окр((ЗапросТовары.Итог("Сумма") + ?(Шапка.СуммаВключаетНДС, 0, ЗапросТовары.Итог("СуммаНДС"))), 2);
	КонецЕсли;
	
	ОбластьМакета.Параметры.ОтпущеноНаСуммуПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСуммаСНДС, глЗначениеПеременной("ВалютаРегламентированногоУчета"), КодЯзыкаПечать);
	Если ЗапросТовары.Итог("СуммаНДС") > 0 Тогда
		ОбластьМакета.Параметры.СуммаНДС                = ОбщегоНазначения.ФорматСумм(ЗапросТовары.Итог("СуммаНДС"), глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	КонецЕсли;
	
	Количество = ЗапросТовары.Итог("Количество");
	
	
	КоличествоМест = Объект.КвоМест;
	КоличествоМестПрописью = НРег(ЧислоПрописью(КоличествоМест,"Л=uk_UK"));
	ОбластьМакета.Параметры.КоличествоМестПрописью  = Лев(КоличествоМестПрописью,СтрДлина(КоличествоМестПрописью)-3);
	
	Если Не КорректировкаМассы Тогда 
		ВесЯщика = Константы.umk_ВесЯщика.Получить();
		Мас = Объект.Масса + Окр((Объект.КвоМест * ВесЯщика) / 1000, 3);
	Иначе
		Мас = Объект.Масса;
	КонецЕсли;
		
	М = Строка(Окр((Мас - Цел(Мас)) * 1000, 0));
	МассаБруттоПрописью = НРег(ЧислоПрописью(КоличествоМест,"Л=uk_UK"));
	ОбластьМакета.Параметры.Масса_брутто_прописью  = ?(Цел(Мас) = 0, "нуль", Формат(Цел(Мас), "ЧП")) + " тн. "  + Строка(Окр((Мас - Цел(Мас)) * 1000, 0)) + " кг.";
 
	ТабДокумент.Вывести(ОбластьМакета);
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();


	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	КоличествоСтрок = ЗапросТовары.Количество();


	// инициализация итогов по странице
	ИтогоКоличествоНаСтранице = 0;
	ИтогоСуммаСНДСНаСтранице  = 0;

	// инициализация итогов по документу
	ИтогоМест       = 0;
	ИтогоКоличество = 0;
	ИтогоСуммаСНДС  = 0;
	НомерСтроки     = 0;

	// Выводим многострочную часть докмента
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Для Каждого ВыборкаСтрок Из ЗапросТовары Цикл
		
		
		Если ОпределятьЦенуПоТипуЦен Тогда
			СуммаСНДС = ВыборкаСтрок.СуммаСНДС;
			СуммаБезНДС = СуммаСНДС;
		Иначе
			СуммаСНДС   = Окр((ВыборкаСтрок.Сумма + ?(Шапка.СуммаВключаетНДС, 0, ВыборкаСтрок.СуммаНДС)), 2);
			СуммаБезНДС = СуммаСНДС-ВыборкаСтрок.СуммаНДС;
		КонецЕсли;
		
		ИтогоСуммаСНДС  = ИтогоСуммаСНДС  + СуммаСНДС;

	КонецЦикла;
	
	ОбластьМакета.Параметры.НомерСтроки = 1;
	ОбластьМакета.Параметры.ТоварНаименование = "м`яснi вироби згідно видат. накл. №" + Документ.Номер + " від " + Формат(Документ.Дата,"ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.Количество = КоличествоМест;
	ОбластьМакета.Параметры.Сумма = ИтогоСуммаСНДС;
	ОбластьМакета.Параметры.ДокументыСопровождения = ДокументыСопровождения;
	ОбластьМакета.Параметры.Масса = Окр(Мас, 3);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогоКоличество = КоличествоМест;
	ОбластьМакета.Параметры.ИтогоСуммаСНДС  = ИтогоСуммаСНДС;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.ФИОВодителя  = Объект.Водитель;
	ФИОДолжностьКладовщик = ПолучитьКладовщика();
	
	ФИОКладовщик = ФИОДолжностьКладовщик.ФИОСотрудник;
	ДолжностьКладовщик = umk_Доработки.ДолжностьОтветственногоЛицаОрганизации(ФИОДолжностьКладовщик.Физлицо, Шапка.ДатаДокумента, Шапка.Организация);
	
	Если Не ЭтоФОП Тогда 
		ОбластьМакета.Параметры.ФИОКладовщик = "" + ФИОКладовщик + ", " + ДолжностьКладовщик.Должность;	
	Иначе
		 ОбластьМакета.Параметры.ФИОКладовщик =  Шапка.ЮрФизЛицо.НаименованиеПолное;  // Для ФОПа
	КонецЕсли;
	
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	//Параметры транспортных средств
	ОбластьМакета = Макет.ПолучитьОбласть("ДанныеПроАвто");
	ПараметрыАвто = Справочники.ОсновныеСредства.ПараметрыАвто(АвтомобильСсылка);
	ОбластьМакета.Параметры.Заполнить(ПараметрыАвто);
	ТабДокумент.Вывести(ОбластьМакета);

	
	//погрузочные операции
	ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	ТабДокумент.Вывести(ОбластьМакета);

КонецПроцедуры // ЗаполнитьТТН()

#КонецОбласти

#Область СобытийЭлементовФормы

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("ТТН, РежимВыбора, Организация, Период", Истина, Истина, Организация, Объект.Дата);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаВыбораУФ",Парам,,,,,Новый ОписаниеОповещения("АвтомобильВыборЗавершение",ЭтаФорма));

КонецПроцедуры

&НаКлиенте
Процедура АвтомобильВыборЗавершение(Результат, ДопПараметры)Экспорт
	
	Если Не Результат = Неопределено Тогда
		
		АвтомобильСсылка = Результат;
		Автомобиль = СокрЛП(Строка(АвтомобильСсылка));
		ПриИзмененииАвтомобиля();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильСсылкаПриИзменении(Элемент)
	
	Автомобиль = СокрЛП(Строка(АвтомобильСсылка));
	ПриИзмененииАвтомобиля();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.МаркаИГосНомерАвтомобиля = Текст;
	Автомобиль = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("ТТН, РежимВыбора,Организация", Истина, Истина, Организация);
	ОткрытьФорму("Справочник.СотрудникиОрганизаций.Форма.ФормаВыбораУФ",Парам,,,,,Новый ОписаниеОповещения("ВодительВыборЗавершение",ЭтаФорма));

КонецПроцедуры

&НаКлиенте
Процедура ВодительВыборЗавершение(Результат, ДопПараметры)Экспорт
	
	Если Не Результат = Неопределено Тогда
		Объект.Водитель = СокрЛП(Строка(Результат));
		Объект.Удостоверение = ЗначениеРеквизитаСервер(Результат,"umk_УдостоверениеВодителя");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	УстановитьВидПеревозки();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("ТТН, РежимВыбора", Истина, Истина);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУФ",Парам,,,,,Новый ОписаниеОповещения("ПеревозчикВыборЗавершение",ЭтаФорма));

КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикВыборЗавершение(Результат, ДопПараметры)Экспорт
	
	Если Не Результат = Неопределено Тогда
		Объект.Перевозчик = СокрЛП(Строка(Результат));
		УстановитьВидПеревозки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.Перевозчик = Текст;
	УстановитьВидПеревозки();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	Объект.Межгород = Не Объект.Город;
	ВидПеревозки();
КонецПроцедуры

&НаКлиенте
Процедура МежгородПриИзменении(Элемент)
	Объект.Город = Не Объект.Межгород;
	ВидПеревозки();
КонецПроцедуры

&НаКлиенте
Процедура МассаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
// Заполним данные рс перед печатью документа
Процедура ЗпаписатьДанныеФормыВРС()
	
	ЗаписьРегистра = РегистрыСведений.umk_ДанныеПутевыеЛисты.СоздатьМенеджерЗаписи();
	
	ЗаписьРегистра.Документ = Документ;
	ЗаписьРегистра.МаркаИГосНомерАвтомобиля = Объект.МаркаИГосНомерАвтомобиля;
	ЗаписьРегистра.ГосНомерПрицепа = Объект.ГосНомерПрицепа;
	ЗаписьРегистра.ПунктПогрузки =  Объект.ПунктПогрузки;
	ЗаписьРегистра.ПунктРазгрузки = Объект.ПунктРазгрузки;
	ЗаписьРегистра.Водитель = Объект.Водитель;
	ЗаписьРегистра.Перевозчик = Объект.Перевозчик;
	ЗаписьРегистра.ВидПеревозки = Объект.ВидПеревозки;
	ЗаписьРегистра.ТипЦен = Объект.ТипЦен;
	ЗаписьРегистра.НомерТТН = Объект.НомерТТН;
	ЗаписьРегистра.Дата = Объект.Дата;
	ЗаписьРегистра.КорректировкаМассы = Объект.КорректировкаМассы;
	ЗаписьРегистра.КвоМест = Объект.КвоМест;
	ЗаписьРегистра.Масса = Объект.Масса;
	ЗаписьРегистра.Удостоверение = Объект.Удостоверение;
	ЗаписьРегистра.Город = Объект.Город;
	ЗаписьРегистра.Межгород = Объект.Межгород;
	ЗаписьРегистра.АвтомобильСсылка = АвтомобильСсылка;
	
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКладовщика()
	
	ФИОДолжность = Новый Структура("ФИОКладовщик, Физлицо");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	umk_ГрафикиРаботыСкладскихРаботников.Сотрудник.Физлицо.Наименование КАК ФИОСотрудник,
		|	umk_ГрафикиРаботыСкладскихРаботников.Сотрудник.Физлицо КАК Физлицо
		|ИЗ
		|	РегистрСведений.umk_ГрафикиРаботыСкладскихРаботников КАК umk_ГрафикиРаботыСкладскихРаботников
		|ГДЕ
		|	umk_ГрафикиРаботыСкладскихРаботников.Период = &Дата");
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ФИОДолжность.Вставить("ФИОСотрудник", Выборка.ФИОСотрудник);
		ФИОДолжность.Вставить("Физлицо", Выборка.Физлицо)
	Иначе
		ФИОДолжность.Вставить("ФИОСотрудник", "");
		ФИОДолжность.Вставить("Физлицо", "")		
	КонецЕсли;
	
	Возврат ФИОДолжность
	
КонецФункции

&НаСервере
Функция ПолучитьУК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УдостоверениеКачества.Номер,
		|	УдостоверениеКачества.Дата КАК Дата
		|ИЗ
		|	Документ.УдостоверениеКачества КАК УдостоверениеКачества
		|ГДЕ
		|	УдостоверениеКачества.Дата <= &Дата
		|	И УдостоверениеКачества.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата)); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ", декларацiя виробника №" + Выборка.Номер + " вiд " +  Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат ""
	КонецЕсли;

КонецФункции

&НаСервере
Процедура УстановитьНомер()
	
	НомерТТН = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И НомерТТН <> "" Тогда
		
		НомерТТН = "Р" + НомерТТН;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") И НомерТТН <> "" Тогда
		
		НомерТТН = "РО" + НомерТТН;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") И НомерТТН <> "" Тогда
		
		НомерТТН = "П" + НомерТТН;
		
	Иначе
		
		НомерТТН = "";
	
	КонецЕсли;
	
	Объект.НомерТТН = НомерТТН;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуПоРегистру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|*
		|ИЗ
		|	РегистрСведений.umk_ДанныеПутевыеЛисты КАК umk_ДанныеПутевыеЛисты
		|ГДЕ
		|	umk_ДанныеПутевыеЛисты.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

&НаСервере
Процедура УстановитьМассу()
	
	Если Не КорректировкаМассы Тогда
		
		Если ЗначениеЗаполнено(Документ) Тогда
			Масса = 0;
			МасссаДок = Документ.Товары.Итог("Количество")* КратностьПечати;
			Если Цел(МасссаДок) <> МасссаДок Тогда
				МасссаДок = Цел(МасссаДок) + 1;
			КонецЕсли;
			Масса = Масса + МасссаДок;
			КГВЯщике = Константы.umk_КГВЯщике.Получить();
			Объект.КвоМест = ?(КГВЯщике = 0, 0, Макс(Окр(Масса / КГВЯщике, 0), 1));
			Объект.Масса = Масса / 1000;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипЦен()

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров")
	 ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда

		Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
			Объект.ТипЦен = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПродажи");
		КонецЕсли;
	Иначе
		Объект.ТипЦен = Неопределено;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьДоступность()

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров")
	 ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		ДоступностьТипаЦен = Истина;
	Иначе
		ДоступностьТипаЦен = Ложь;
	КонецЕсли;
	
	Элементы.ТипЦен.Доступность        = ДоступностьТипаЦен;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидПеревозки()
	
	НашаОрганизация = Справочники.Организации.НайтиПоНаименованию(СокрЛП(Объект.Перевозчик));
	ГоловнаяОрганизация = Константы.umk_ГоловнаяОрганизация.Получить();
	Если ЗначениеЗаполнено(НашаОрганизация) Тогда
		// Если это ФОП то всегда межгород.
		ЭтоФОП = Не (Строка(СокрЛП(НашаОрганизация)) = Строка(СокрЛП(ГоловнаяОрганизация)));
		Если ЭтоФОП Тогда
			Объект.Межгород = Истина;
			ВидПеревозки();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидПеревозки()
	
	Объект.ВидПеревозки = ?(Объект.Город, "міські", "міжміські");

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииАвтомобиля()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ПараметрыТранспортаСрезПоследних.ГосНомер КАК ГосНомер,
		|	umk_ПараметрыТранспортаСрезПоследних.Водитель,
		|	umk_ПараметрыТранспортаСрезПоследних.ОсновноеСредство.НаименованиеПолное КАК Марка,
		|	umk_ПараметрыТранспортаСрезПоследних.Водитель.umk_УдостоверениеВодителя КАК УдостоверениеВодителя
		|ИЗ
		|	РегистрСведений.umk_ПараметрыТранспорта.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК umk_ПараметрыТранспортаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ОсновноеСредство", АвтомобильСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() тогда
		 Объект.Водитель= Выборка.Водитель;
		 Объект.Удостоверение = Выборка.УдостоверениеВодителя;
		 Объект.МаркаИГосНомерАвтомобиля = СокрЛП(Выборка.Марка);//СокрП(Выборка.ГосНомер) + " " + СокрП(Выборка.Марка);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаСервер(ОбъектСсылка, ИмяРеквизита)
	 Возврат ОбъектСсылка[ИмяРеквизита]
КонецФункции

#КонецОбласти
